# LinkInstanceNeedsReconcile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures..::..LinkInstanceNeedsReconcile Property
BuiltInFailures..::..LinkFailures Class See Also
---
Instance of linked .rvt file needs Coordination Review
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LinkInstanceNeedsReconcile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LinkInstanceNeedsReconcile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LinkInstanceNeedsReconcile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LinkFailures Class
Autodesk.Revit.DB Namespace